#include <iostream>

int main() {
    setlocale(LC_ALL, "Rus");
    std::cout << "Я помню чудное мгновенье:\n";
    std::cout << "Передо мной явилась ты,\n";
    std::cout << "Как мимолетное виденье,\n";
    std::cout << "Как гений чистой красоты.\n";
    std::cout << "В томленьях грусти безнадежной,\n";
    std::cout << "В тревогах шумной суеты,\n";
    std::cout << "Звучал мне долго голос нежный\n";
    std::cout << "И снились милые черты.\n";
    std::cout << "Шли годы. Бурь порыв мятежный\n";
    std::cout << "Рассеял прежние мечты,\n";
    std::cout << "И я забыл твой голос нежный,\n";
    std::cout << "Твои небесные черты.\n";
    std::cout << "В глуши, во мраке заточенья\n";
    std::cout << "Тянулись тихо дни мои\n";
    std::cout << "Без божества, без вдохновенья,\n";
    std::cout << "Без слез, без жизни, без любви.\n";
    std::cout << "Душе настало пробужденье:\n";
    std::cout << "И вот опять явилась ты,\n";
    std::cout << "Как мимолетное виденье,\n";
    std::cout << "Как гений чистой красоты.\n";
    std::cout << "И сердце бьется в упоенье,\n";
    std::cout << "И для него воскресли вновь\n";
    std::cout << "И божество, и вдохновенье,\n";
    std::cout << "И жизнь, и слезы, и любовь.\n";
    return 0;
}